{
    "id": "getting-started",
    "title": "Getting Started",
    "description": "Introduction & Quick Setup",
    "image": "/assets/logo.png",
    "articles": [
        {
            "id": "what-is-codrocket",
            "title": "What is CODRocket?",
            "image": "/assets/logo.png",
            "body": "<img src='/assets/logo.png' alt='CODRocket Logo' style='max-width: 200px; height: auto; margin-bottom: 20px;' /><p>CODRocket is a Shopify app designed to make Cash on Delivery (COD) orders simple, fast, and reliable. Instead of forcing customers through Shopify’s standard checkout process, which can feel long or complicated, CODRocket gives your store a direct Buy Button and Order Form tailored specifically for COD payments. This makes it easier for customers who prefer COD to complete purchases — and helps merchants increase sales.</p> <h4>Key Features</h4><br><ul><li><strong>🛒 COD Buy Button</strong><br>Easily add one-click COD checkout buttons to your product and cart pages. Customers can skip unnecessary steps and place their order instantly.</li><li><strong>📝 Customizable Order Form</strong><br>Create an order form that fits your business needs. Collect important details such as:<ul><li>Full name</li><li>Phone number</li><li>Address (city, region, postal code)</li><li>Custom fields (e.g., “Delivery instructions”)</li></ul>This ensures you capture all the information needed for COD fulfillment.</li><li><strong>🚚 Shipping Rules</strong><br>Set flexible COD conditions for your store:<ul><li>Restrict COD to certain regions or countries</li><li>Set minimum/maximum order values for COD</li><li>Apply custom shipping fees for COD orders</li></ul>This helps reduce fraudulent, high-risk, or unprofitable COD orders.</li><li><strong>🏷️ Order Tagging</strong><br>Automatically tag COD orders in Shopify. These tags make it easy to filter, track, and manage COD transactions directly from your Shopify admin panel.</li><li><strong>🌍 Multi-Language Support</strong><br>Offer COD forms and buttons in multiple languages. CODRocket adapts to your customers’ needs, allowing you to sell confidently in local or international markets.</li></ul>"
        },
        {
            "id": "install-codrocket",
            "title": "How to Install CODRocket on Your Shopify Store",
            "body": "<h3><strong>Installation Steps</strong></h3><br><h4><strong>Step 1:</strong> Find CODRocket in the Shopify App Store</h4><p>Go to your Shopify admin panel, navigate to the Apps section, and click on 'Visit Shopify App Store'. Search for 'CODRocket' and select the app.</p><br><img src='/assets/Step1.png' alt='Step 1: Search for CODRocket' style='max-width: 100%; height: auto; margin: 20px 0;' /><br><h4><strong>Step 2:</strong> Install the App</h4><p>Click the 'Add app' button. Review the permissions and click 'Install app' to grant the necessary access (orders, scripts, and storefront access).</p><br><img src='/assets/Step2.png' alt='Step 2: Install CODRocket' style='max-width: 100%; height: auto; margin: 20px 0;' /><br><h4><strong>Step 3:</strong> Access the Dashboard</h4><p>After installation, you'll be redirected to the CODRocket dashboard in your Shopify admin Apps section. You're now ready to configure your COD settings!</p><br><img src='/assets/Step3.png' alt='Step 3: CODRocket Dashboard' style='max-width: 100%; height: auto; margin: 20px 0;' /><br><h4><strong>Conclusion</strong></h4><p>Congratulations on successfully installing CODRocket! Your Shopify store is now enhanced with advanced COD capabilities. Explore the dashboard to set up your COD options, customize forms, and start offering Cash on Delivery payments to your customers.</p>"
        },
        {
            "id": "quick-setup-first-button",
            "title": "Quick Setup Guide (First COD Button)",
            "body": "<h3><strong>Quick Setup Guide</strong></h3><br><div style='border: 2px solid red; padding: 10px; margin: 10px 0; background-color: #fff5f5;'><strong>Warning:</strong> To start using CODRocket, you need to select the pricing plan that fits your needs from the available options.</div><br><img src='/assets/QuickSetupGuide.png' alt='Quick Setup Guide' style='max-width: 100%; height: auto; margin: 20px 0;' /><br><p>Once your plan is selected, open the features section to customize and enable the COD options you require for your store.</p><br><h4><strong>Now You Have Access to App Features</strong></h4><p>With CODRocket installed, you now have access to powerful app features including the form builder for customizing COD order forms, shipping rules for controlling COD availability, order tagging for easy management, and multi-language support to reach global customers.</p>"
        },
        {
            "id": "system-requirements",
            "title": "System Requirements & Compatibility",
            "body": "<h3><strong>System Requirements & Compatibility</strong></h3><br><img src='/assets/Shopify_logo_2018.png' alt='Shopify Logo' style='max-width: 150px; height: auto; float: right; margin-left: 20px;' /><h4><strong>Supported Themes</strong></h4><p>CODRocket is fully compatible with modern Shopify themes, including Online Store 2.0 and most legacy themes. This ensures seamless integration with your store's design.</p><br><h4><strong>Recommended Setup</strong></h4><p>For the best experience, use a Shopify store with a theme version that supports app blocks. This allows for easier placement of COD buttons and forms without custom coding.</p><br><h4><strong>Browser Compatibility</strong></h4><p>CODRocket works perfectly on the latest desktop and mobile browsers, providing a consistent experience for both merchants and customers.</p><br><h4><strong>Need Help?</strong></h4><p>If your theme heavily customizes the checkout process, contact our support team for personalized guidance on placing the COD Buy Button effectively.</p>"
        }
    ]
}