{
    "id": "getting-started",
    "title": "Getting Started",
    "description": "Introduction & Quick Setup",
    "articles": [
        {
            "id": "what-is-codrocket",
            "title": "What is CODRocket?",
            "body": "<p>CODRocket is a Shopify app designed to make Cash on Delivery (COD) orders simple, fast, and reliable. Instead of forcing customers through Shopify’s standard checkout process, which can feel long or complicated, CODRocket gives your store a direct Buy Button and Order Form tailored specifically for COD payments. This makes it easier for customers who prefer COD to complete purchases — and helps merchants increase sales.</p> <h4>Key Features</h4><br><ul><li><strong>🛒 COD Buy Button</strong><br>Easily add one-click COD checkout buttons to your product and cart pages. Customers can skip unnecessary steps and place their order instantly.</li><li><strong>📝 Customizable Order Form</strong><br>Create an order form that fits your business needs. Collect important details such as:<ul><li>Full name</li><li>Phone number</li><li>Address (city, region, postal code)</li><li>Custom fields (e.g., “Delivery instructions”)</li></ul>This ensures you capture all the information needed for COD fulfillment.</li><li><strong>🚚 Shipping Rules</strong><br>Set flexible COD conditions for your store:<ul><li>Restrict COD to certain regions or countries</li><li>Set minimum/maximum order values for COD</li><li>Apply custom shipping fees for COD orders</li></ul>This helps reduce fraudulent, high-risk, or unprofitable COD orders.</li><li><strong>🏷️ Order Tagging</strong><br>Automatically tag COD orders in Shopify. These tags make it easy to filter, track, and manage COD transactions directly from your Shopify admin panel.</li><li><strong>🌍 Multi-Language Support</strong><br>Offer COD forms and buttons in multiple languages. CODRocket adapts to your customers’ needs, allowing you to sell confidently in local or international markets.</li></ul>"
        },
        {
            "id": "install-codrocket",
            "title": "How to Install CODRocket on Your Shopify Store",
            "body": "1) From the Shopify App Store, find CODRocket and click 'Add app'. 2) Grant the requested store permissions (orders, scripts, and storefront access). 3) After installation, open the CODRocket dashboard from your Shopify admin Apps section."
        },
        {
            "id": "quick-setup-first-button",
            "title": "Quick Setup Guide (First COD Button)",
            "body": "1) In the CODRocket dashboard choose 'Quick start' → 'Add COD Button'. 2) Pick the placement (product page, cart, or a floating action button) and set a label (for example, 'Pay by COD'). 3) Save and preview on a product page — use a development/sandbox theme first. 4) Place a test order to verify the button appears and the order flow captures the COD option and tags the order."
        },
        {
            "id": "system-requirements",
            "title": "System Requirements & Compatibility",
            "body": "CODRocket supports modern Shopify themes (Online Store 2.0 and most legacy themes). Recommended: Shopify store with theme version that supports app blocks for easier placement. Browser compatibility: latest desktop and mobile browsers. If your theme heavily customizes checkout, contact support for guidance on placing the COD Buy Button."
        }
    ]
}